ewowi/projectMM/src/platform/esp32/platform_esp32_i80.cpp
// Parallel WS2812 output over the ESP-IDF esp_lcd i80 bus — the peripheral half of MultiPinLedDriver
// (src/light/drivers/MultiPinLedDriver.h), which does all the domain work: applies Correction and
// 3-slot-encodes every light into the DMA frame buffer (ParallelSlots.h). This file owns only the
// peripheral — the esp_lcd i80 bus, the IO device, the DMA-capable frame buffer, transmit + wait,
// and the loopback test's TX side. No domain logic here.
//
// Design: the whole frame is pre-encoded into ONE buffer and sent as ONE gapless GDMA stream
// (tx_color with lcd_cmd = -1 → pure data phase). Once started, no CPU work remains until the done
// callback — there is no refill deadline for WiFi to miss, the deliberate difference from the
// ISR-refilled rings in the hpwit/FastLED I2S lineage this design studied.
//
// **One seam, two silicon backends.** IDF's esp_lcd component exposes ONE public i80 API
// (esp_lcd_new_i80_bus / esp_lcd_panel_io_tx_color / esp_lcd_i80_alloc_draw_buffer) and routes it,
// via its own CMake, to whichever peripheral the chip has: **LCD_CAM** on the S3/P4
// (esp_lcd_panel_io_i80.c) or the **I2S peripheral in i80/LCD mode** on the classic ESP32
// (esp_lcd_panel_io_i2s.c). Both do WHOLE-FRAME chained DMA with WR/DC + 8/16 bus width, so this
// file's body is 100% generic i80 and serves both — the single MultiPinLedDriver runs on all three.
//
// Gated on SOC_LCD_I80_SUPPORTED (true on classic + S3 + P4) with inert stubs otherwise. This is the
// BROAD macro on purpose (not the narrower SOC_LCDCAM_I80_LCD_SUPPORTED), precisely so the classic
// I2S backend compiles here too. (An earlier note warned against the broad macro — that was before
// an i2s-backed driver existed, so compiling this onto classic init'd a bus with no consumer; now
// MultiPinLedDriver is that consumer on every i80 chip.)

#include "platform/platform.h"

#include "sdkconfig.h"
#include "soc/soc_caps.h"

// SOC_LCD_I80_SUPPORTED: the generic esp_lcd i80 API, backed by LCD_CAM on the S3/P4 and by
// the I2S peripheral on the classic ESP32 — both selected by IDF's own CMake. The body below
// is backend-agnostic. (esp_lcd i80 headers exist wherever SOC_LCD_I80_SUPPORTED is set.)
#if SOC_LCD_I80_SUPPORTED

#include "esp_lcd_panel_io.h"
#include "esp_lcd_io_i80.h"
#include "esp_log.h"
#include "esp_timer.h"   // esp_timer_get_time — ISR-safe wire-time stamp
#include "esp_heap_caps.h"
#include "driver/gpio.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

#include <cstring>
#include <functional>  // the transmit callback passed to the shared frame loopback
#include <new>      // std::nothrow
#if !SOC_LCDCAM_I80_LCD_SUPPORTED
#include "esp_private/i2s_platform.h"   // the I2S0 occupancy probe (the same API esp_lcd's I2S backend uses)
#endif

namespace mm::platform {

// Defined in platform_esp32_rmt.cpp — the plain-GPIO continuity pre-check the
// RMT loopback uses; the wire question is identical here.
namespace detail { bool loopbackJumperOk(uint8_t txGpio, uint8_t rxGpio); }

namespace {

static const char* I80_TAG = "mm_i80";

// The lcd_cmd passed to esp_lcd_panel_io_tx_color. LCD_CAM (S3/P4) takes -1 = "no command phase"
// (pure data). The classic I2S backend has an UNCONDITIONAL command phase (see the lcd_cmd_bits note
// in createState), so it needs a real 8-bit command: 0 is a benign no-op byte that completes the
// backend's command poll before the WS2812 data frame.
#if SOC_LCDCAM_I80_LCD_SUPPORTED
constexpr int kI80Cmd = -1;
#else
constexpr int kI80Cmd = 0;
#endif

// 3 slots per WS2812 bit (the ParallelSlots.h contract): 2.67 MHz pclk = 375 ns
// slots, "0" = 1 slot HIGH, "1" = 2 slots HIGH. 375 ns and not the lineage's
// usual 416 ns: newer WS2812B revisions spec T0H max ≈ 380 ns, and on a
// direct 3.3 V data line (no level shifter) a longer "0" pulse gets misread
// as "1" — the strip washes out white. 375 ns sits inside every revision's
// window; the 160 MHz LCD clock divides to it exactly (/60).
constexpr uint32_t kPclkHz = 2'666'666;

// Pixel clock with a 74HCT595 expander fitted. **The constraint that matters is the WS2812 SLOT
// DURATION, not the elegance of the divider — getting that backwards is what broke the first bench
// run.** A '595 shifts each slot out over `clockMultiplier` bus words, so:
//
//     slot = clockMultiplier / pclk        and the slot IS the "0" pulse (T0H).
//
// WS2812B spec: **T0H 200-380 ns** (newer revisions cap ~380 — see lessons.md #5, the max-white
// flicker), T1H 580-1000 ns. The direct path picks 2.67 MHz for a 375 ns slot, right at that edge.
//
// The first attempt here was 20 MHz "because it divides exactly": 8 × 50 ns = **400 ns**, which is
// OVER the 380 ns T0H max. Bench result (2026-07-14, board B): the strands rendered scattered
// MAX-BRIGHTNESS pixels and washed-out white — zeros being read as ones, exactly lesson #5. An exact
// divider that produces an out-of-spec waveform is worthless; the divider is a means, not the goal.
//
// 26.67 MHz (prescale 3 off the 80 MHz bus resolution — still an exact divide, so esp_lcd's
// silent round-down cannot bite):
//     slot = 8 / 26.67 MHz  = 300 ns   T0H 300 (spec 200-380 ✓)  T1H 600 (spec 580-1000 ✓)
//
// (This band is also why a ×16 cascade is NOT offered: it needs a 42-55 MHz pclk to stay in spec, and
// NO exact divide of 80 MHz lands there — the divides are 80/40/20/16/10. Two pins beat two cascaded
// registers on every axis anyway; see ParallelSlots.h kPinExpanderOutputs.)
//
// **Do NOT "fix" flicker by lowering this clock** — that was the original note's advice and it is
// exactly backwards: a lower pclk makes the slot LONGER, pushing T0H further past 380 ns. If the
// waveform ever needs adjusting, adjust it *up* (prescale 2 -> 40 MHz -> 200 ns slot, the bottom of
// the T0H window) and check the buffer can carry the rate. The fitted SN74HCT245N (t_pd ~10-18 ns)
// has real but adequate margin at 37.5 ns per shift cycle.
constexpr uint32_t kShiftPclkHz = 26'666'666;   // prescale 3 of 80 MHz -> 300 ns WS2812 slots


// Two DMA frame buffers for the async deferred-wait double-buffer: the driver encodes frame N+1
// into buf[1-active] while the GDMA clocks frame N out of buf[active]. buf[1] is null when the
// second allocation didn't fit (single-buffer mode — the driver runs the old wait-every-frame path
// on buf[0]). Each buffer has its OWN done-semaphore so a wait targets the right transfer.
//
// With trans_queue_depth 2 both buffers can be in flight at once (N draining while N+1 is queued),
// and the empty esp_lcd done-event carries no per-transfer token — but the i80 GDMA completes
// transfers in ENQUEUE order, so a 2-slot FIFO of enqueued buffer indices, popped in the callback,
// routes each done-signal to the buffer that actually finished. (This is the textbook completion-
// FIFO for an in-order DMA queue; the depth is 2 because at most two transfers — one per buffer —
// are ever outstanding.)
struct I80State {
    esp_lcd_i80_bus_handle_t bus = nullptr;
    esp_lcd_panel_io_handle_t io = nullptr;
    SemaphoreHandle_t done[2] = {nullptr, nullptr};
    uint8_t* buf[2] = {nullptr, nullptr};
    size_t cap = 0;   // shared per-buffer capacity (both buffers equal)
    // In-order completion FIFO of enqueued buffer indices (0/1). enqueue at head under a critical
    // section around tx_color; the ISR pops at tail. Only ever 0..2 entries (one per buffer).
    volatile uint8_t fifo[2] = {0, 0};
    volatile uint8_t fifoHead = 0;   // next write slot (mod 2)
    volatile uint8_t fifoTail = 0;   // next read slot (mod 2)
    // Wire-time KPI: the start timestamp of the oldest in-flight transfer (paired with the FIFO,
    // so it tracks the transfer the next done-callback completes), and the last measured duration.
    volatile int64_t txStartUs[2] = {0, 0};
    volatile uint32_t lastTransmitUs = 0;
};

// Done-callback: the GDMA stream finished — pop the oldest enqueued buffer index (transfers
// complete in enqueue order), record the wire duration (now − that transfer's start), and release
// THAT buffer's waiter. esp_timer_get_time() is ISR-safe (it reads a hardware counter).
//
// IRAM_ATTR: the DMA-done ISR calls this from interrupt context, so keeping it out of flash is the
// correct, defensive choice (matches the sibling Parlio done-cb) — everything it touches is IRAM-safe
// (esp_timer_get_time reads a hardware counter, xSemaphoreGiveFromISR, plain member stores). The
// classic I2S backend's extra quirk (an unconditional command phase that busy-waits) is handled by
// the kI80Cmd / lcd_cmd_bits split above, not here.
bool IRAM_ATTR i80DoneCb(esp_lcd_panel_io_handle_t, esp_lcd_panel_io_event_data_t*, void* user) {
    auto* st = static_cast<I80State*>(user);
    const uint8_t slot = st->fifoTail;
    const uint8_t b = st->fifo[slot] & 1u;
    const int64_t now = esp_timer_get_time();
    st->lastTransmitUs = static_cast<uint32_t>(now - st->txStartUs[slot]);
    st->fifoTail = (st->fifoTail + 1u) & 1u;
    // In-order queue: a buffer already queued behind this one starts the instant this transfer ends —
    // stamp its true start here, since the transmit call deliberately skipped stamping it (the wire was
    // busy). Without this the second buffer's frameTime would include this one's remaining wire time.
    if (st->fifoTail != st->fifoHead) st->txStartUs[st->fifoTail] = now;
    BaseType_t high = pdFALSE;
    xSemaphoreGiveFromISR(st->done[b], &high);
    return high == pdTRUE;
}

void destroyState(I80State* st) {
    if (!st) return;
    if (st->io) esp_lcd_panel_io_del(st->io);
    if (st->bus) esp_lcd_del_i80_bus(st->bus);
    for (auto* b : st->buf) if (b) heap_caps_free(b);
    for (auto* s : st->done) if (s) vSemaphoreDelete(s);
    delete st;
}

// One bus + IO device + DMA buffer(s). `wantSecond` allocates the async double-buffer's second
// frame buffer (best-effort — null if it won't fit); false allocates buffer 0 only. Shared by the
// runtime init and the loopback's private bus (which passes false — one transfer).
I80State* createState(const uint16_t* dataPins, uint8_t laneCount,
                      uint16_t wrGpio, uint16_t dcGpio, size_t bufferBytes, bool wantSecond,
                      uint8_t clockMultiplier = 1) {
    auto* st = new (std::nothrow) I80State();
    if (!st) return nullptr;

