ewowi/projectMM/src/platform/esp32/platform_esp32_i80.cpp
    esp_lcd_i80_bus_config_t busCfg = {};
    busCfg.dc_gpio_num = static_cast<gpio_num_t>(dcGpio);
    busCfg.wr_gpio_num = static_cast<gpio_num_t>(wrGpio);
    busCfg.clk_src = LCD_CLK_SRC_DEFAULT;
    // Bus width is power-of-two only (8 or 16), derived from the lane count: ≤8 → 8,
    // 9..16 → 16. The domain driver already guarantees exactly 8 or 16 real data pins.
    const size_t busWidth = laneCount <= 8 ? 8 : 16;
    busCfg.bus_width = busWidth;
    // The i80 layer REJECTS an NC data pin (unlike Parlio), so every data line up to
    // bus_width must be a real GPIO. A board that drives fewer than bus_width lanes
    // parks the unused ones on the WR "ghost pin" (hpwit's trick) — WR toggles on it
    // harmlessly, and the domain driver clears those lanes' activeMask so they idle.
    for (size_t i = 0; i < ESP_LCD_I80_BUS_WIDTH_MAX; i++) {
        busCfg.data_gpio_nums[i] = (i < busWidth) ? static_cast<gpio_num_t>(wrGpio)
                                                  : GPIO_NUM_NC;
    }
    for (uint8_t i = 0; i < laneCount && i < busWidth; i++) {
        busCfg.data_gpio_nums[i] = static_cast<gpio_num_t>(dataPins[i]);
    }
    busCfg.max_transfer_bytes = bufferBytes;
    busCfg.dma_burst_size = 64;
    if (esp_lcd_new_i80_bus(&busCfg, &st->bus) != ESP_OK) {
        destroyState(st);
        return nullptr;
    }

    // One done-semaphore per buffer (buf[1]'s is created only when its buffer allocates).
    st->done[0] = xSemaphoreCreateBinary();
    if (!st->done[0]) {
        destroyState(st);
        return nullptr;
    }

    esp_lcd_panel_io_i80_config_t ioCfg = {};
    ioCfg.cs_gpio_num = GPIO_NUM_NC;    // no chip select — we own the bus
    // A '595 expander shifts each WS2812 slot out over 8 bus words, so the bus must clock 8× faster
    // to keep the slot inside the WS2812 bit window. kShiftPclkHz is that rate — and it is one of the
    // EXACT divides of the 80 MHz bus resolution, because esp_lcd silently rounds an inexact pclk DOWN
    // into a wrong waveform rather than reporting it (see kShiftPclkHz).
    ioCfg.pclk_hz = (clockMultiplier > 1) ? kShiftPclkHz : kPclkHz;
    // Queue depth 2 so the deferred-wait tick can hand the IO device the next frame's transfer while
    // the current one is still draining (the double-buffer). The driver still waits before REUSING a
    // buffer, so at most two transfers (one per buffer) are ever outstanding.
    //
    // **Shift mode drops to depth 1, and it is NOT a fix — it is a narrowing.** With the expander's
    // ×8 frame, EVERY GDMA mount fails (`lli full need=38 avail=3`) whatever the depth, and the
    // failure is silent: tx_color returns ESP_OK because the enqueue succeeded — the mount fails later
    // in the ISR — so the driver waits out a 1 s timeout per frame and the strands hold stale data.
    // Depth 1 was tried because `avail` counts only what the PREVIOUS transfer released
    // (gdma_link_mount_buffers walks from index 0 and stops at the first DMA-owned descriptor,
    // gdma_link.c:163-174, `check_owner`), so serialising the mounts *should* have made the pool
    // available. It did not. Neither did doubling the pool (76 descriptors verified on-device against
    // a need of 38). Direct mode is unaffected: 0 errors on every bench board.
    //
    // Six hypotheses are ruled out by measurement; the open one is IDF's own note that without
    // descriptor write-back "descriptor is always owned by DMA after being used". Full account +
    // what NOT to re-try: docs/history/shift-register-driver-analysis.md § 7.5.
    ioCfg.trans_queue_depth = (clockMultiplier > 1) ? 1 : 2;
    ioCfg.on_color_trans_done = i80DoneCb;
    ioCfg.user_ctx = st;
    // LCD_CAM backend (S3/P4): no command phase — tx_color(cmd = -1) skips it, so cmd_bits = 0.
    // Classic I2S backend: its tx_color has an UNCONDITIONAL command phase that busy-waits for the
    // command DMA's TX_EOF. With cmd_bits = 0 that command buffer is zero-length, the DMA never
    // asserts EOF, and the poll loop hangs → interrupt-watchdog reset (WROVER bench, 2026-07-13). So
    // give the i2s backend a real 8-bit command phase: one benign byte clocks out (completing the
    // poll) before the WS2812 data frame. It rides in the inter-frame idle-LOW gap, within the strand
    // latch window, so the strands ignore it. (See the classic-only cmd value at each tx_color call.)
#if SOC_LCDCAM_I80_LCD_SUPPORTED
    ioCfg.lcd_cmd_bits = 0;
#else
    ioCfg.lcd_cmd_bits = 8;
#endif
    ioCfg.lcd_param_bits = 0;
    ioCfg.flags.pclk_idle_low = 1;      // WR rests LOW like the data lines
    if (esp_lcd_new_panel_io_i80(st->bus, &ioCfg, &st->io) != ESP_OK) {
        destroyState(st);
        return nullptr;
    }

    // DMA-capable draw buffer. On the LCD_CAM backend (S3/P4) the i80 GDMA can burst straight from
    // PSRAM (access_ext_mem), so allocate PSRAM-first to keep the large 16-bit frame off scarce
    // internal DRAM. But the classic ESP32's I2S-i80 backend CANNOT DMA from PSRAM —
    // esp_lcd_i80_alloc_draw_buffer rejects MALLOC_CAP_SPIRAM there with "external memory is not
    // supported" (bench-confirmed on the WROVER, 2026-07-13). So the PSRAM attempt is compiled in
    // ONLY on the LCD_CAM chips; the classic backend goes straight to internal DMA RAM. IDF also does
    // its own DMA/ext-mem cache alignment for whichever region it lands in. Zeroed so the trailing
    // latch pad holds the lines LOW.
    // **Shift mode prefers INTERNAL RAM; direct mode prefers PSRAM.**
    //
    // Direct mode: PSRAM first, as above — the frame is large, the 2.67 MHz pixel clock is easy to
    // sustain from PSRAM, and keeping it out of scarce internal DRAM is the right trade.
    //
    // Shift mode: internal first. **Measured, not theorised** (board B, S3, 2026-07-14): with the
    // expander's 8× frame in PSRAM the strands flicker wildly and the GDMA logs thousands of mount
    // failures; with the frame in internal RAM the same strands render smooth and flicker-free. The
    // mechanism is NOT yet understood — the obvious explanations (PSRAM bandwidth, descriptor pool
    // size, FIFO underrun) have each been tested and refuted, and the P4 runs the identical frame from
    // PSRAM perfectly. So this is an empirical preference, honestly labelled as one.
    //
    // It is a STOPGAP, not the destination: internal DMA RAM is ~110 KB, which caps a shift display at
    // roughly 2,000 lights — less than direct mode already reaches. PSRAM is what makes large displays
    // possible and the driver must get back to it. PSRAM therefore remains the fallback (a frame too
    // big for internal RAM still runs, just poorly, rather than refusing to drive at all).
    //
    // Full account + what has already been ruled out: docs/history/shift-register-driver-analysis.md § 7.5.
#if SOC_LCDCAM_I80_LCD_SUPPORTED
    // Only the LCD_CAM backend can reach PSRAM at all, so the preference only exists here. (The
    // classic ESP32's i80 is the I2S peripheral, whose DMA cannot address PSRAM — it takes the
    // internal-only path below unconditionally, and never asks the question.)
    const bool pinExpanderMode = clockMultiplier > 1;
    if (!pinExpanderMode)
        st->buf[0] = static_cast<uint8_t*>(esp_lcd_i80_alloc_draw_buffer(
            st->io, bufferBytes, MALLOC_CAP_DMA | MALLOC_CAP_SPIRAM));
    if (!st->buf[0])
#endif
        st->buf[0] = static_cast<uint8_t*>(esp_lcd_i80_alloc_draw_buffer(
            st->io, bufferBytes, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL));
#if SOC_LCDCAM_I80_LCD_SUPPORTED
    // Shift mode wanted internal RAM and could not have it (a frame too big): take PSRAM rather than
    // refuse to drive. Expect the flicker until the frame fits or the real fix lands.
    if (!st->buf[0] && pinExpanderMode) {
        ESP_LOGW(I80_TAG, "shift frame (%u B) does not fit internal DMA RAM — using PSRAM; "
                          "expect stalled transfers. Reduce lights per strand.", (unsigned)bufferBytes);
        st->buf[0] = static_cast<uint8_t*>(esp_lcd_i80_alloc_draw_buffer(
            st->io, bufferBytes, MALLOC_CAP_DMA | MALLOC_CAP_SPIRAM));
    }
#endif
    if (!st->buf[0]) {
        destroyState(st);
        return nullptr;
    }
    std::memset(st->buf[0], 0, bufferBytes);
    st->cap = bufferBytes;

    // Second buffer for the async double-buffer — ONLY when asked (wantSecond). Off by default, so
    // the common path allocates exactly one frame buffer and pays no async memory. When wanted, same
    // PSRAM-first-else-internal allocate-and-degrade: if it fits, arm double-buffer mode (buf[1] + its
    // semaphore); if it doesn't (memory-tight board), leave buf[1] null and run single-buffer. The
    // double-buffer is never *required* (allocate-and-degrade, ADR 0002).
    if (wantSecond) {
        st->done[1] = xSemaphoreCreateBinary();
        if (st->done[1]) {
            // buf[1] follows buf[0]'s allocation POLICY exactly (same region preference per mode), so the
            // async back buffer never lands where the front one refused to: PSRAM-first only in DIRECT mode
            // (LCD_CAM reaches PSRAM fine at the 2.67 MHz clock); in SHIFT mode the LCD_CAM GDMA can't
            // sustain a PSRAM read at the 26.67 MHz expander clock, so internal-first — a PSRAM buf[1] there
            // would stall exactly like a PSRAM buf[0] does. PSRAM doesn't touch the scarce internal DMA heap,
            // so no reserve check on that branch.
#if SOC_LCDCAM_I80_LCD_SUPPORTED
            if (!pinExpanderMode)
                st->buf[1] = static_cast<uint8_t*>(esp_lcd_i80_alloc_draw_buffer(
                    st->io, bufferBytes, MALLOC_CAP_DMA | MALLOC_CAP_SPIRAM));
#endif
            // Internal fallback ONLY if it leaves HEAP_RESERVE intact — the second buffer is a nice-to-
            // have (allocate-and-degrade), so it must never eat the WiFi/HTTP reserve. Without this guard
            // a default-ON async board whose frame lands internal (e.g. a big moving-head frame, or the
            // P4 where PSRAM DMA degrades) would drop internal RAM below the reserve → WiFi/HTTP alloc
            // failures. Degrade to single-buffer instead. This is also the FIRST attempt in shift mode.
            if (!st->buf[1]
                && heap_caps_get_largest_free_block(MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL)
                       >= bufferBytes + HEAP_RESERVE) {
                st->buf[1] = static_cast<uint8_t*>(esp_lcd_i80_alloc_draw_buffer(
                    st->io, bufferBytes, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL));
            }
            if (st->buf[1]) {
                std::memset(st->buf[1], 0, bufferBytes);
            } else {
                // No room for the second buffer — drop its unused semaphore, stay single-buffer.
                vSemaphoreDelete(st->done[1]);
                st->done[1] = nullptr;
            }
        }
    }
    return st;
}

