ewowi/projectMM/src/platform/esp32/platform_esp32_i80.cpp
uint8_t* i80Ws2812Buffer(const I80Ws2812Handle& h, uint8_t buffer) {
    auto* st = static_cast<I80State*>(h.impl);
    return (st && buffer < 2) ? st->buf[buffer] : nullptr;
}

size_t i80Ws2812BufferCapacity(const I80Ws2812Handle& h) {
    auto* st = static_cast<I80State*>(h.impl);
    return st ? st->cap : 0;
}

bool i80Ws2812Transmit(I80Ws2812Handle& h, uint8_t buffer, size_t bytes) {
    auto* st = static_cast<I80State*>(h.impl);
    if (!st || !st->io || buffer >= 2 || !st->buf[buffer] || bytes == 0 || bytes > st->cap) return false;
    // Push this buffer onto the completion FIFO BEFORE enqueuing the transfer, so a fast done-callback
    // (which pops the FIFO) can never fire before its slot is populated. The push is the only thing the
    // ISR races, and it is a couple of plain stores into slot `fifoHead` — the ISR only ever reads slot
    // `fifoTail`, and head != tail while a transfer is in flight (the driver waits before reusing a
    // buffer), so the push and the pop touch DIFFERENT slots. That slot-disjointness is what makes the
    // push safe without a lock. **Do NOT wrap tx_color in a critical section:** esp_lcd_panel_io_tx_color
    // blocks on an internal FreeRTOS queue (xQueueSend/Receive), and calling a blocking RTOS API from
    // inside taskENTER_CRITICAL panics (spinlock held + interrupts off). Push, then enqueue outside any CS.
    const uint8_t slot = st->fifoHead;
    const bool wireIdle = (st->fifoHead == st->fifoTail);   // nothing in flight → this one starts NOW
    st->fifo[slot] = buffer;
    // Stamp the wire-time start only when the wire is IDLE (enqueue == hardware-start). If a transfer is
    // already clocking out, this one does not begin until that one ends, so stamping here would fold the
    // predecessor's remaining wire time into this buffer's measured duration. The done-callback stamps it
    // instead, at the moment the hardware actually starts it.
    if (wireIdle) st->txStartUs[slot] = esp_timer_get_time();
    st->fifoHead = (st->fifoHead + 1u) & 1u;
    // lcd_cmd = -1: no command phase — the transfer is one continuous GDMA data stream, gapless
    // at the pclk rate.
    const esp_err_t err = esp_lcd_panel_io_tx_color(st->io, kI80Cmd, st->buf[buffer], bytes);
    if (err != ESP_OK) {
        // Enqueue failed — unwind the FIFO push so the ISR count stays balanced. Safe: a failed
        // enqueue produced no transfer, so no done-callback will pop this slot.
        st->fifoHead = (st->fifoHead + 1u) & 1u;
    }
    return err == ESP_OK;
}

bool i80Ws2812Wait(I80Ws2812Handle& h, uint8_t buffer, uint32_t timeoutMs) {
    auto* st = static_cast<I80State*>(h.impl);
    if (!st || buffer >= 2 || !st->done[buffer]) return true;   // nothing to wait on = not in flight
    // Report whether the transfer actually completed. On a timeout the DMA may still be reading this
    // buffer, so the caller must keep it marked in-flight rather than re-encoding into it — handing a
    // live DMA a half-rewritten buffer is exactly the frame corruption the timeout is meant to avoid.
    return xSemaphoreTake(st->done[buffer], pdMS_TO_TICKS(timeoutMs)) == pdTRUE;
}

uint32_t i80Ws2812LastTransmitUs(const I80Ws2812Handle& h) {
    auto* st = static_cast<I80State*>(h.impl);
    return st ? st->lastTransmitUs : 0;
}

void i80Ws2812Deinit(I80Ws2812Handle& h) {
    auto* st = static_cast<I80State*>(h.impl);
    if (!st) return;
    destroyState(st);
    h.impl = nullptr;
}

// ---------------------------------------------------------------------------
// Loopback self-test: a private FULL-width bus (the i80 layer rejects NC data
// pins, so the driver's complete pin set is rebuilt) transmits the CALLER'S
// real frame — full size, real DMA descriptor chain, real latch pad — back to
// back like the render loop, while an RMT RX channel (rmtWs2812RxCapture with
// the DMA backend — transmitter-agnostic, reused from the RMT rig) captures
// the WHOLE frame off the jumpered rxGpio and verifies every bit. A short
// synthetic burst would miss exactly the failures a real frame hits
// (descriptor boundaries, sustained-rate stalls), so the test sends the
// genuine article.
// ---------------------------------------------------------------------------

// The capture + bit-verify half is shared with the Parlio loopback in
// detail::captureAndVerifyFrame (platform_esp32_rmt.cpp); only the i80 transmit
// differs. Declared here so this TU can call it (same pattern as loopbackJumperOk).
namespace detail {
void captureAndVerifyFrame(uint16_t rxGpio, size_t frameBytes, size_t dataBytes,
                           uint8_t rowBits, uint32_t pclkHz, bool pinExpanderMode, const char* tag,
                           const std::function<void()>& transmitOnce,
                           RmtLoopbackResult& r, bool rideMode = false,
                           uint32_t* rxSymbols = nullptr);
// Pre-allocate the capture buffer captureAndVerifyFrame needs (one contiguous DMA-capable internal
// block, sized from dataBytes) so a caller can grab it BEFORE its own allocations fragment the heap
// (largest-first allocation order). Pass the result as `rxSymbols`; ownership transfers to
// captureAndVerifyFrame regardless of outcome. nullptr on alloc failure is fine to pass through —
// the helper then retries the alloc itself and reports the failure.
uint32_t* allocLoopbackCapture(size_t dataBytes);
}

RmtLoopbackResult i80Ws2812Loopback(const uint16_t* dataPins, uint8_t laneCount,
                                    uint16_t wrGpio, uint16_t dcGpio, uint16_t rxGpio,
                                    const uint8_t* frame, size_t frameBytes,
                                    size_t dataBytes, uint8_t rowBits,
                                    uint8_t clockMultiplier) {
    RmtLoopbackResult r;
    r.sent[0] = 0xA5; r.sent[1] = 0x00; r.sent[2] = 0xFF;  // pattern in every row
    if (!dataPins || laneCount == 0 || !frame || frameBytes == 0
        || dataBytes < 3 || dataBytes > frameBytes || rowBits < 8
        || clockMultiplier == 0) return r;
    const uint16_t txGpio = dataPins[0];   // lane 0 carries the pattern
    const bool pinExpanderMode = clockMultiplier > 1;

    if (pinExpanderMode) {
        // SKIP the continuity pre-check. It drives txGpio and expects rxGpio to follow directly,
        // which is true of a bare jumper but FALSE through a 74HCT595: raising the serial input does
        // not raise an output (that takes 8 shift clocks + a latch). Running it here would report
        // "jumper not detected" on perfectly good wiring. The rx pin is fed from a '595 OUTPUT, so
        // the only proof the wire is right is the bit-verify itself — which is the stronger check
        // anyway (it validates the whole chain: encode → bus → shift → latch → output).
        r.jumperDetected = true;
    } else {
        r.jumperDetected = detail::loopbackJumperOk(static_cast<uint8_t>(txGpio),
                                                    static_cast<uint8_t>(rxGpio));
        if (!r.jumperDetected) return r;
    }

    // The continuity check above reset txGpio's GPIO matrix route; bus
    // creation re-claims it.
    I80State* st = createState(dataPins, laneCount, wrGpio, dcGpio, frameBytes,
                               /*wantSecond=*/false,    // one transfer — single buffer
                               clockMultiplier);        // shift mode → the kShiftPclkHz bus clock
    if (!st) {
        ESP_LOGE(I80_TAG, "loopback: private bus creation failed");
        return r;
    }
    std::memcpy(st->buf[0], frame, frameBytes);   // loopback uses buffer 0 only (single transfer)

