ewowi/projectMM/src/platform/esp32/platform_esp32_i80.cpp
    // The i80-specific transmit: ship one frame from buffer 0 and wait for its done-callback.
    // Everything else (capture, cadence, bit-verify) is the shared helper. The FIFO/semaphore
    // bookkeeping matches the runtime path: push buffer 0, enqueue, the ISR pops and gives done[0].
    auto transmitOnce = [st, frameBytes]() {
        // Loopback self-test path (not the render hot path): surface a failed
        // enqueue or a done-callback timeout instead of letting it show up only as
        // a later capture mismatch (same handling as the Parlio sibling).
        st->fifo[st->fifoHead] = 0;
        st->fifoHead = (st->fifoHead + 1u) & 1u;
        const esp_err_t err = esp_lcd_panel_io_tx_color(st->io, kI80Cmd, st->buf[0], frameBytes);
        if (err != ESP_OK) {
            st->fifoHead = (st->fifoHead + 1u) & 1u;   // unwind the push
            ESP_LOGE(I80_TAG, "loopback: tx enqueue failed (%s)", esp_err_to_name(err));
            return;
        }
        if (xSemaphoreTake(st->done[0], pdMS_TO_TICKS(1000)) != pdTRUE)
            ESP_LOGE(I80_TAG, "loopback: tx done-callback timed out");
    };
    // `pclkHz` tells the verifier the WS2812 SLOT RATE the strand sees — it derives both the pulse-
    // width threshold ("0" = one slot, "1" = two) and the expected transmit duration from it. So it
    // must describe the STRAND's waveform, not the bus.
    //
    // In shift mode the strand's slot is NOT the bus period: `clockMultiplier` bus words fill one
    // slot, so slot rate = pclk / clockMultiplier. At 26.67 MHz ÷ 8 that is 3.33 MHz → a 300 ns slot.
    //
    // Passing kPclkHz (2.67 MHz → 375 ns) in shift mode — which this did, with a comment confidently
    // asserting "the slot is still 375 ns" — makes the capture expect 15-tick pulses while the strand
    // emits 12-tick ones, and sizes the capture window for a frame 8× shorter than the real one. The
    // result is a decode that matches nothing: `bad bit 0/0`, zero bits captured, on a strand whose
    // LEDs were visibly lighting. (Bench, board B, 2026-07-14 — the giveaway was exactly that: the
    // LEDs worked, so a waveform existed; only the capture was blind to it.)
    const uint32_t slotHz = (clockMultiplier > 1) ? (kShiftPclkHz / clockMultiplier) : kPclkHz;
    detail::captureAndVerifyFrame(rxGpio, frameBytes, dataBytes, rowBits, slotHz, clockMultiplier > 1,
                                  I80_TAG, transmitOnce, r);
    destroyState(st);
    return r;
}

} // namespace mm::platform

#else  // !SOC_LCD_I80_SUPPORTED — inert stubs so a chip with no i80 (LCD_CAM or I2S) links

namespace mm::platform {

bool i80Ws2812Init(I80Ws2812Handle&, const uint16_t*, uint8_t, uint16_t, uint16_t,
                   size_t, bool, uint8_t) {
    return false;
}
const char* i80Ws2812LastError() { return nullptr; }
bool i80Ws2812SharedBusFree() { return false; }
uint8_t* i80Ws2812Buffer(const I80Ws2812Handle&, uint8_t) { return nullptr; }
size_t i80Ws2812BufferCapacity(const I80Ws2812Handle&) { return 0; }
bool i80Ws2812Transmit(I80Ws2812Handle&, uint8_t, size_t) { return false; }
bool i80Ws2812Wait(I80Ws2812Handle&, uint8_t, uint32_t) { return true; }
uint32_t i80Ws2812LastTransmitUs(const I80Ws2812Handle&) { return 0; }
void i80Ws2812Deinit(I80Ws2812Handle&) {}
RmtLoopbackResult i80Ws2812Loopback(const uint16_t*, uint8_t, uint16_t, uint16_t,
                                    uint16_t, const uint8_t*, size_t, size_t, uint8_t,
                                    uint8_t) {
    return {};
}

} // namespace mm::platform

#endif  // SOC_LCD_I80_SUPPORTED
